{"_name_or_path":"microsoft/swinv2-base-patch4-window8-256","architectures":["Swinv2ForImageClassification"],"attention_probs_dropout_prob":0,"depths":[2,2,18,2],"drop_path_rate":0.1,"embed_dim":128,"encoder_stride":32,"hidden_act":"gelu","hidden_dropout_prob":0,"hidden_size":1024,"id2label":{"0":"Drivers1","1":"Drivers2","2":"Passports1","3":"Passports2","4":"PTS","5":"STS1","6":"STS2"},"image_size":256,"initializer_range":0.02,"label2id":{"Drivers1":0,"Drivers2":1,"PTS":4,"Passports1":2,"Passports2":3,"STS1":5,"STS2":6},"layer_norm_eps":0.00001,"mlp_ratio":4,"model_type":"swinv2","num_channels":3,"num_heads":[4,8,16,32],"num_layers":4,"out_features":["stage4"],"out_indices":[4],"patch_size":4,"path_norm":true,"pretrained_window_sizes":[0,0,0,0],"problem_type":"single_label_classification","qkv_bias":true,"stage_names":["stem","stage1","stage2","stage3","stage4"],"torch_dtype":"float32","transformers_version":"4.39.3","use_absolute_embeddings":false,"window_size":8}